Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: The allocation of tasks must be documented in writing if there are at least 10 employees in the operation.
sv: Uppgiftsfördelningen skall dokumenteras skriftligt om det finns minst tio arbetstagare i verksamheten.

source: It is appropriate for the employer to apply the same principles to the allocation of tasks referring to use of work equipment involving specific risks.
sv: Det är lämpligt att arbetsgivaren tillämpar samma principer vid uppgiftsfördelning när det gäller användning av arbetsutrustning med särskilda risker.

source: “Specific risks” are risks which can lead to serious accidents or severe ill-health if the work equipment is not handled with great skill and sound judgement.
sv: Med särskilda risker avses risker som kan leda till allvarliga olycksfall eller svår ohälsa om arbetsutrustningen inte hanteras med stor kunnighet och gott omdöme.

source: This section means, in the case of work equipment involving specific risks, that the employer must have documentation showing how these stipulations of the Work Environment Act have been complied with.
sv: Paragrafen innebär att när det gäller arbetsutrustningar med särskilda risker skall arbetsgivaren ha dokumentation hur kraven i denna del av arbetsmiljölagen uppfyllts.

source: It is important for knowledge concerning the work equipment and its use to include aspects with a vital bearing on safety and health, such as construction, operation, control, properties, range of applications, limitations of use and maintenance and inspection.
sv: Det är viktigt att kunskaperna om arbetsutrustningen och dess användning omfattar aspekter som är väsentliga för säkerhet och hälsa, såsom uppbyggnad, drift, manövrering, egenskaper, användningsområde, begränsningar för utrustningen samt underhåll och kontroll.

source: It is also important that the person using the work equipment should acquire a knowledge of the stipulations for using it and of the special risks involved.
sv: Det är även viktigt att den som använder arbetsutrustningen får kännedom om kraven för att få använda den och de särskilda risker det innebär.

source: The manufacturer’s instructions may include particulars of the stipulations which should be made concerning knowledge and training.
sv: Tillverkarens instruktioner kan innehålla uppgifter om vilka krav som bör ställas på kunskaper och utbildning.

source: In certain cases it is impossible to decide simply from the function of the equipment whether a safety device or a safety component is working as it should.
sv: I vissa fall är det inte möjligt att direkt av utrustningens funktion avgöra om en skyddsanordning eller säkerhetskomponent fungerar som den ska.

source: This makes it extra important for the working order of these items to be checked regularly, so that the operator will not be lulled into a false sense of security.
sv: Det är då extra viktigt att regelbundet kontrollera funktionen hos dessa så att operatören inte ges en falsk känsla av säkerhet.

source: Sometimes work equipment is installed, assembled and/or inspected by a person other than the prospective user.
sv: Det förekommer att en arbetsutrustning installeras, monteras och/eller kontrolleras av någon annan än den som skall använda utrustningen.

source: It is important for the user to have access to relevant documentation and also to assess the outcome.
sv: Det är viktigt att användaren får tillgång till relevant dokumentation och även bedömer resultatet.

source: It is important that a certificate showing when the last inspection took place should accompany work equipment if the documentation from the inspection is not available for consulting in or near the equipment.
sv: Det är viktigt att ett bevis på när den senaste kontrollen utfördes åtföljer en arbetsutrustning om dokumentationen från kontrollen inte finns tillgänglig för kontroll i eller i närheten av den.

source: More detailed specifications are to be found in harmonised standards, which are not binding.
sv: Närmare specifikationer finns i harmoniserade standarder, som inte är bindande.

source: Such standards reflect the level of technical development at the time of their issue.
sv: Sådana standarder återspeglar den tekniska utvecklingsnivån då de utfärdas.

source: They are primarily intended for products manufactured after their entry into force.
sv: De är primärt avsedda för produkter som tillverkas efter det att de trätt i kraft.

source: But there is nothing to prevent such standards also being consulted with reference to older equipment.
sv: Det är emellertid inget som hindrar att man söker vägledning i sådana standarder även när det gäller äldre utrustning.

source: 25 so it is important to bear in mind that it is not the intention for “old” work equipment to be upgraded to a level matching the stipulations for “new” equipment of a similar kind.
sv: Det är då viktigt att man tar hänsyn till att avsikten inte är att ”gammal” arbetsutrustning skall uppgraderas till en nivå som motsvarar kraven på ”ny” motsvarande utrustning.

source: Musculoskeletal ergonomics
sv: Belastningsergonomi

source: Controls and control systems
sv: Manöveranordningar och styrsystem

source: impacts and vibrations
sv: stötar och vibrationer

source: It is also important that dangerous functions should not be triggered by switching from one mode of operation to another, e.g. from manual to automatic control.
sv: Det är också viktigt att farliga funktioner inte utlöses genom omkoppling från ett driftsätt till ett annat, t.ex. från manuell till automatisk drift.

source: It is important that the safety level of the safety function of control equipment should be commensurate with the risk of injury occurring in the event of a fault in the equipment.
sv: Det är viktigt att säkerhetsnivån på en styrutrustnings skyddsfunktion ställs i relation till risken för personskada vid fel på utrustningen.

source: If a fault in the control equipment implies an immediate risk of injury, it is generally necessary for the safety function to remain when a fault occurs in a component.
sv: Om det är omedelbar risk för personskada vid fel i styrutrustningen är det i allmänhet nödvändigt att skyddsfunktionen kvarstår vid fel i en komponent.

source: Allowance does not generally need to be made for component faults which are unlikely to occur in practice.
sv: Hänsyn behöver i allmänhet inte tas till komponentfel som sannolikt inte kan inträffa i praktiken.

source: If a unit in work equipment has been separately stopped, e.g. as a result of an interlocking safety guard being opened and a person entering the unit’s work zone, it is important that it should not be possible to move from there into a danger zone pertaining to another part of the equipment which has not been stopped.
sv: Om en enhet i en arbetsutrustning har stoppats separat, t.ex. genom att ett förreglande avskärmningsskydd öppnats, och någon går in i enhetens arbetsområde, är det viktigt att det därifrån inte är möjligt att gå vidare till ett riskområde i en annan del av arbetsutrustningen som inte är stoppad.

source: It is also important that material or workpieces from other parts of the work equipment cannot be fed forward.
sv: Det är också viktigt att material eller arbetsstycken från andra delar av arbetsutrustningen inte kan matas fram.

source: When designing and using work equipment, allowance must be made to ergonomic aspects of man’s capacity for perceiving and understanding information.
sv: När en arbetsutrustning utformas och används måste hänsyn tas till ergonomiska aspekter på människans förmåga att uppfatta och förstå information.

source: The equipment and use of the same must be adapted to the way in which
sv: Utrustningen och användningen måste anpassas efter hur

source: our senses operate (vision, hearing, touch etc.),
sv: våra sinnen fungerar: synen, hörseln, känseln etc.,

source: A logical connection between the movement of controls and the resultant effect on work equipment is important, e.g. with an upward lever movement being matched by a resultant upward movement when exercising vertical control.
sv: En logisk koppling mellan manöverorganens rörelse och resulterande effekt på arbetsutrustningen är viktig, exempelvis att en spakrörelse uppåt motsvaras av en resulterande rörelse uppåt vid styrning i höjdled.

source: Stop
sv: Stopp

source: If a machine has a long roll-out time, this can entail a great risk of the operator or some other person coming into contact with those parts of the machine which have not yet come to a halt.
sv: Lång utrullningstid hos en maskin kan medföra stor risk för operatören eller annan person som kommer i kontakt med de delar av maskinen som inte hunnit stanna.

source: If work equipment requires braking to bring it to a complete standstill safely, it is important that the brake should be directly actuated by the control device.
sv: Om en arbetsutrustning är beroende av en broms för att den skall kunna stoppas helt och under säkra förhållanden är det viktigt att bromsen aktiveras direkt av manöverdonet.‌‌

source: Emergency stop
sv: Nödstopp

source: Setting and programming
sv: Inställning och programmering

source: Moreover, the person carrying out the work may have to enter the danger zone of the work equipment, e.g. in order to check and adjust machine functions.
sv: Den som utför arbetet kan dessutom vara tvungen att befinna sig i arbetsutrustningens riskområde, t.ex. för att kunna kontrollera och ställa in maskinfunktioner.

source: If so, it is appropriate for the person doing the work to be able to control the machine’s movements directly, e.g. by means of a holding device.
sv: Det är då lämpligt att den som utför arbetet kan styra maskinrörelsen genom direkt kontroll, t.ex. med hålldon.

source: It is important that the machine should not be simultaneously controllable from any other control unit.
sv: Det är viktigt att det samtidigt inte går att styra från någon annan styrenhet.

source: It is often appropriate for movements during setting and programming to be possible at reduced speed (crawling) or power.
sv: Det är ofta lämpligt att rörelser vid inställning och programmering kan utföras med reducerad hastighet (krypfart) eller kraft.

source: Falling and ejected objects
sv: Fallande föremål och utkast

source: A parting knife designed for the purpose and correctly set, preventing kickback in a circular saw used for wood.
sv: En för ändamålet utformad och korrekt inställd klyvkniv som förhindrar återkast på en cirkelsåg för trä.

source: A locking device for a tool spindle in a grinding machine, that allow the grinding tool to rotate without being ejected if the tool spindle can stop so quickly that the grinding tool is liable to come loose.
sv: En låsanordning till en verktygsspindel i en slipmaskin som tillåter att slipverktyget kan rotera utan att slungas i väg om verktygsspindeln kan stanna så snabbt att slipverktyget riskerar att lossna.

source: Clamping and stabilising
sv: Fastspänning och stabilisering

source: A 2.12
sv: Materialbrott

source: Examples of measures to be taken when material failure is a safety hazard:
sv: Till A 2.12 Exempel på åtgärder när materialbrott medför risk för säkerheten:

source: Pressure pipes, e.g. hydraulic tubes, are positioned or protected in such a way that they are not exposed to wear, corrosion or other interference capable of impairing their mechanical strength.
sv: Tryckledningar, t.ex. hydraulledningar, är placerade eller skyddade så att de inte utsätts för slitage, korrosion eller annan åverkan som kan minska deras hållfasthet.

source: Pressure pipes are attached, positioned or protected in such a way that they cannot cause any injury by bursting.
sv: Tryckledningar är fastsatta, placerade eller skyddade så att personskador inte uppstår om ledningen brister.

source: It is important that the protection should enclose as large a portion of the grinding tool as work permits.
sv: Det är viktigt att det omsluter så stor del av slipverktyget som arbetet medger.

source: An openable guard is generally mechanically united (e.g. by hinges or guides) with the frame of the work equipment or with a nearby fixed part and can be opened without tools.
sv: Ett öppningsbart skydd är i allmänhet mekaniskt förbundet (t.ex. genom gångjärn eller gejdrar) med arbetsutrustningens stomme eller med en närbelägen fast del och det kan öppnas utan användning av verktyg.

source: The type and frequency of access affect the type of guard which should be chosen.
sv: Typ av tillträde och tillträdesfrekvens påverkar vilken typ av skydd som bör väljas.

source: A fixed guard is appropriate when no access is needed during a work cycle.
sv: Det är lämpligt att använda ett fast skydd när tillträde inte krävs under en arbetscykel.

source: Where access is needed during a work cycle, an openable guard is an appropriate choice.
sv: Där tillträde krävs under en arbetscykel är det lämpligt att välja öppningsbara förreglande skydd.‌

source: This is particularly important if
sv: Detta är särskilt viktigt om

source: the hazardous function is controlled by software or automatically,
sv: den farliga funktionen styrs av program eller automatik,

source: the hazardous function can occur suddenly or unexpectedly,
sv: den farliga funktionen kan uppträda plötsligt eller oväntat,

source: If justified by the risk, it is appropriate for an openable guard also to have an interlocking function so that it will remain closed and locked as long as the hazardous functions are in progress.
sv: Om risken motiverar det är det lämpligt att ett öppningsbart skydd även har en förreglande låsfunktion så att skyddet förblir stängt och låst så länge de farliga funktionerna pågår.

source: In larger danger zones where a person may be present inside a closed guard, supplementary protection is often advisable, especially if it is difficult to see the whole of the danger zone.
sv: Vid större riskområden där någon kan finnas innanför ett stängt skydd är det ofta lämpligt med kompletterande skydd, särskilt om det är svårt att se hela riskområdet.

source: In the case of a handheld or manually fed machine, e.g. a saw, milling machine or planer, where the machine tool cannot be completely screened off during machining, it is important that the machine tool guard should be easy to set and adjust if setting is not automatic.
sv: Till A 2.14 Vid handhållen och vid manuellt matad maskin, t.ex. såg, fräs eller hyvel där det inte går att avskärma maskinverktyget helt under bearbetningen, är det viktigt att skyddet vid maskinverktyget är lätt att ställa in och använda om det inte ställs in automatiskt.

source: Automatically adjusted guards are preferable with a view to a high standard of safety in practice.
sv: Skydd som ställs in automatiskt är att föredra för att säkerheten i praktiken skall bli hög.

source: Pinch points
sv: Valsingrepp

source: mechanisation of the work by means of entry guides,
sv: arbetet mekaniseras genom att använda inledare,

source: Disconnection of energy supply
sv: Frånkoppling av energitillförsel

source: To facilitate disconnection of the energy supply, and to reduce the risk of any disconnection measure being overlooked, it is appropriate for the disconnection devices for one and the same item of work equipment to be grouped together.
sv: Till A 2.22 För att underlätta frånkopplingen av energitillförsel och för att minska risken att någon frånkopplingsåtgärd glöms är det lämpligt att frånkopplingsanordningarna till en arbetsutrustning sammanförs.

source: Marking, signage and warning devices
sv: Märkning, skyltar och varningsanordningar

source: Marking and signage can, for example, indicate maximum load, speed or capacity.
sv: Märkning och skyltar kan t.ex. informera om maximal last, varvtal eller kapacitet.

source: Signage can indicate that the equipment may only be used under certain conditions.
sv: Skyltar kan upplysa om att utrustningen bara får användas under vissa betingelser.

source: Signage can also indicate the personal protective equipment which use requires.
sv: Skyltar kan också informera om vilken personlig skyddsutrustning som krävs vid användningen.

source: It is important that warning signs should convey sufficient information concerning risks associated by noise and vibrations.
sv: Det är viktigt att varningsskyltar ger tillräcklig information om risker från buller och vibrationer.

source: Depending on the noise and vibration levels emitted by equipment, an assessment has to be made of the exposure permissible for a user.
sv: Beroende på vilka buller- resp. vibrationsnivåer som en utrustning avger måste en bedömning göras om vilken exponering man kan tillåta för en användare.

source: Rules concerning noise and vibrations are contained in special Provisions issued by the Work Environment Authority.
sv: Regler om buller och vibrationer finns i särskilda föreskrifter från Arbetsmiljöverket.

source: Access routes and work zones
sv: Tillträdesvägar och arbetsområden

source: It is therefore important that access routes and other zones where people need to be present should be appropriately designed.
sv: Det är därför viktigt att tillträdesvägar och andra områden där närvaro fordras är ändamålsenligt utformade.

source: It is especially important for work equipment to be maintained with the risk of slipping, tripping or falling in mind.
sv: Det är särskilt viktigt att gammal arbetsutrustning underhålls med hänsyn till risken att halka, snubbla eller falla.

source: For example, worn-out stair treads should be replaced.
sv: Exempelvis bör utslitna halkband på trappor bytas ut.

source: Old and worn-out rubber and plastic mats should also be replaced with new ones which are more slip-proof.
sv: Åldrade och utslitna gummi- och plastmattor bör också ersättas med nya som är mer halkbeständiga.

source: Fire hazards and emissions
sv: Brandrisk och utsläpp

source: It is important to take the fire properties of hydraulic fluid into consideration if in the event of leakage it is liable to come into contact with hot material or a naked flame or to ignite in some other way.
sv: Det är viktigt att ta hänsyn till hydraulvätskans brandegenskaper om den vid läckage riskerar att komma i kontakt med hett material, öppen låga eller om den kan antändas på annat sätt.

source: Rules concerning occupational exposure limit values and measures to combat air contaminants are contained in special Provisions issued by the Work Environment Authority.
sv: Regler om hygieniska gränsvärden och åtgärder mot luftföroreningar finns i särskilda föreskrifter från Arbetsmiljöverket.

source: Mobile work equipment
sv: Mobil arbetsutrustning

source: Mobile work equipment can entail risks over and above those caused by mobility.
sv: Mobil arbetsutrustning kan medföra risker utöver de som orsakas av mobilitet.

source: Self-propelled work equipment‌
sv: Självgående arbetsutrustning

source: A parking brake is a common device to prevent mobile work equipment from being unintentionally set in motion.
sv: Till A 3.1.8 i) Parkeringsbroms är en vanlig anordning på mobil arbetsutrustning för att skydda mot oavsiktlig rörelse.

source: Pallet racks and other warehousing racks
sv: Pallställ och andra lagerställ

source: Warehousing racks other than pallet racks include, for example, shelving racks, cantilever racking and deep racks.
sv: Till A 3.2 Exempel på lagerställ är förutom pallställ t.ex. hyllställ, grenställ, och djupstaplingsställ.

source: A risk of instability is normally considered to exist if the total height of the pallet rack is four times the pallet racking depth or if the racking unit has pull-out units or back stays.
sv: Risk för instabilitet anses normalt föreligga om pallställets totalhöjd är fyra gånger högre än pallställsdjupet eller om det har utdragsenheter eller ryggstag.

source: Guidance on Annex B
sv: Kommentarer till bilaga B

source: Assembly, installation, dismantling, service, maintenance, cleaning and inspection
sv: Montering, installation, demontering, service, underhåll, rengöring och besiktning

source: This applies not least to work like assembly, installation, dismantling, service, maintenance and cleaning.
sv: Det gäller inte minst vid arbeten som montering, installation, demontering, service, underhåll och rengöring.

source: For planning purposes it is vital to take the company’s activities as the starting point and to analyse all the risk sources that can conceivably arise.
sv: Vid planeringen är det avgörande att ha företagets verksamhet som utgångspunkt och att analysera alla tänkbara riskkällor som kan uppstå.

source: Larger operations often have a maintenance department which is responsible for the coordination of assembly, installation, dismantling, servicing and maintenance work within the organisation.
sv: I större verksamheter finns det ofta en underhållsavdelning som har samordningsansvaret för monterings-, installations-, demonterings-, service- och underhållsarbeten inom den egna organisationen.

source: When one or more contractors are engaged it is important to establish responsibility for co-ordination; cf. Chap. 3, Section 7 of AML.
sv: När en eller flera entreprenörer anlitas är det viktigt att fastställa samordningsansvaret, jfr. 3 kap. 7 § AML.

source: Regardless of whether the work is carried out under the firm’s own auspices or contractors are engaged, information transfer is always important.
sv: Oavsett om arbetet bedrivs i egen regi eller om entreprenörer anlitas är det alltid viktigt med informationsöverföring.

source: This applies not least when one or more persons take over a job which has already been started.
sv: Det gäller inte minst när en eller flera personer tar över ett arbete som redan påbörjats.

source: Cutting off energy inputs has a decisive bearing on safety in connection with servicing, maintenance and cleaning work.
sv: Att bryta ingående energier är avgörande för säkerheten vid service-, underhålls- och rengöringsarbeten.

source: Very often too it may be appropriate to check that the energy inputs really have been cut off, e.g. by trying to test-start the equipment before work commences.
sv: Många gånger kan det också vara lämpligt att kontrollera att de ingående energierna verkligen är brutna, t.ex. genom att försöka provstarta utrustningen innan arbetet påbörjas.

source: If the person or persons carrying out the servicing, maintenance or cleaning work do not have the switching device under constant surveillance, it is also important that the device should be locked in the disconnected position, so that no one else can inadvertently turn on the energy supply to the equipment.
sv: Om den eller de som utför service-, underhålls- eller rengöringsarbetet inte har kontinuerlig uppsikt över brytdonet är det också viktigt att låsa det i brutet läge.

source: Relief or blockage of accumulated energy is essential for safety.
sv: Avlastning eller blockering av ackumulerad energi är centralt för säkerheten.

source: Accumulated energy can, for example, take the form of tensioned springs, components in the elevated or hoisted position, pneumatic components under pressure, charged condensers etc.
sv: Exempel på ackumulerad energi kan vara spända fjädrar, komponenter som är i upplyft eller upphissat läge, pneumatiska komponenter som är trycksatta, uppladdade kondensatorer etc.

source: The normal procedure, then, in connection with servicing, maintenance and cleaning work is to disconnect energy inputs and lock them in the disconnected position, except where manifestly unnecessary.
sv: Det normala förfarandet vid service-, underhålls- och rengöringsarbete är alltså att bryta ingående energier och låsa dem i brutet läge, om det inte är uppenbart onödigt.
